0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    door
    {
        type            totalPressure;
        p0              uniform 0;   // ambient gauge pressure
        value           uniform 0;
    }
    vent
    {
        type            zeroGradient;
    }
    room
    {
        type            zeroGradient;
    }

    /*toilet
    {
        type            zeroGradient;
    }*/
    /*human
    {
        type            zeroGradient;
    }

    floor
    {
        type            zeroGradient;
    }
    symmCut
    {
        type            symmetryPlane;
    }*/
}


// ************************************************************************* //
