system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


toilet.stl
{
    extractionMethod    extractFromSurface;
    writeObj            yes;
    includedAngle       150;
}

vent.stl
{
    extractionMethod    extractFromSurface;
    writeObj            yes;
    includedAngle       150;
}

door.stl
{
    extractionMethod    extractFromSurface;
    writeObj            yes;
    includedAngle       150;
}
room.stl
{
    extractionMethod    extractFromSurface;
    writeObj            yes;
    includedAngle       150;
}




// ************************************************************************* //
